not_group = ("Группа не найдена.\nТакс, ну тут всего два варианта:\n"
             "    1) Расписания твоей группы нет в моей базе данных (тогда напиши моему разработчику, "
             "он все исправит)\n"
             f"   2) Неправильно введена группа (проверь, может быть где-то стоит не та цифра)")

hello_messages = ("Приветствую тебя! Я - бот СурГУ и я знаю расписание всех групп (нууу, почти всех).\n"
                  "Проведу тебе небольшую экскурсию по моим возможностям.\n\n"
                  "Умею я следующее:\n"
                  "• 000-00 - установка номера группы по умолчанию, в любой момент можно изменить это значение\n"
                  "• пн [вт, ср, чт, пт, сб] - получить расписание на конкретный день недели\n"
                  "• сегодня [завтра] - делает тоже самое, что и пункт выше, но для сегодня и завтра\n"
                  "• звонки - получить расписание звонков\n"
                  "• неделя - узнать по какой неделе учимся (числитель или знаменатель)\n"
                  "• 22.02 - получить расписание на конкретную дату\n"
                  "• инфо - выведет список команд, на случай, если ты их забудешь\n\n"
                  "Начни с установки номера группы по умолчанию (команда 000-00)\n\n"
                  "Также хочу тебя предупредить, расписание сгенерировано автоматически, поэтому возможны ошибки. "
                  "Если в вашем расписании ошибка или его вовсе нет, то напишите одному из руководителей группы. Мы "
                  "обязательно всё исправим")
# "• оповещение - включить или отключить оповещения о скором начале пары (в разработке). Если "
# "оповещения включены, то за 10 минут до начала занятия я отправлю соответсвующее сообщение\n "

info_messages = ("Список команд:\n"
                 "•  000-00 - установка номера группы по умолчанию, в любой момент можно изменить это значение\n"
                 "•  пн [вт, ср, чт, пт, сб] - получить расписание на конкретный день недели\n"
                 "•  сегодня [завтра] - делает тоже самое, что и пункт выше, но для сегодня и завтра\n"
                 "•  звонки - получить расписание звонков\n"
                 "•  неделя - узнать по какой неделе учимся (числитель или знаменатель)\n"
                 "•  22.02 - получить расписание на конкретную дату\n"
                 "•  инфо - выведет список команд, на случай, если ты их забудешь")
# "•  оповещение - включить или отключить оповещения о скором начале пары (в разработке). Если "
# "оповещения включены, то за 10 минут до начала занятия я отправлю соответсвующее сообщение\n "

schedule_calls = 'Расписание звонков для корпусов АГКУ:\n' \
                 '\t1 пара - 08:00-09:30\n' \
                 '\t2 пара - 09:40-11:10\n' \
                 '\t3 пара - 11:20-12:50\n' \
                 '\t4 пара - 13:20-14:50\n' \
                 '\t5 пара - 15:00-16:30\n' \
                 '\t6 пара - 16:40-18:10\n' \
                 '\t7 пара - 18:20-19:50\n' \
                 '\t8 пара - 20:00-21:30\n' \
                 '\nРасписание звонков для СК "Дружба":\n' \
                 '\t1 пара - 08:30-10:00\n' \
                 '\t2 пара - 10:10-11:40\n' \
                 '\t3 пара - 11:50-13:20\n' \
                 '\t4 пара - 13:30-15:00\n' \
                 '\t5 пара - 15:05-16:35\n' \
                 '\nРасписание звоноков для ОЦ "Водолей"\n' \
                 '\t1 пара - 11:00-10:45\n' \
                 '\t2 пара - 11:45-12:30\n' \
                 '\t3 пара - 12:30-13:15\n' \
                 '\t4 пара - 13:15-14:00\n'
